# Pandas 

Pandas is an important python library for data manipulation, wrangling and analysis

Data structures of Panda:
    
> series : 1D

> Data frame : 2D
    
What Can Pandas Do?
Pandas gives you answers about the data. Like:

> Is there a correlation between two or more columns?

> What is average value?

> Max value?

> Min value?

> Pandas are also able to delete rows that are not relevant, or contains wrong values, like empty or NULL values. This is called cleaning the data.

Series

1D ndarray with an axis label

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.1.1'

Syntax to create series:
    
pd.series (data, index)

In [3]:
s = ([2,3,4,1,5,32])
type(s)

list

# Creating a series from a list

In [4]:
import pandas as pd
s = pd.Series ([2,3,4,1,5,32])
print(s)
print(type(s)) # data type in output is of the value and not index.. and it shld be value of same
# data type. it will type cast everything into a similar data

0     2
1     3
2     4
3     1
4     5
5    32
dtype: int64
<class 'pandas.core.series.Series'>

# Creating a series from ndarray

In [5]:
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data)
print (s)

0    a
1    b
2    c
3    d
dtype: object

#### We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1, i.e., 0 to 3.

> In the next cell lets try to add some index

In [6]:
#import the pandas library and aliasing as pd
import pandas as pd
import numpy as np
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print (s)

100    a
101    b
102    c
103    d
dtype: object

# Create Series from Dictionary

In [7]:
population_dict = {
    'California':38956785,
    'Texas':26441568,
    'New York':19555647,
    'Florida':12364569,
    'Illinois':12882135
}

population_dict

{'California': 38956785,
 'Texas': 26441568,
 'New York': 19555647,
 'Florida': 12364569,
 'Illinois': 12882135}

In [8]:
type(population_dict)

dict

In [9]:
population = pd.Series(population_dict)
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [10]:
type(population)

pandas.core.series.Series

In [11]:
population['California'] # retreving data using label indexing # explicit - index given by user

38956785

In [12]:
population[0] # retreving data using default indexing # implicit - index generated by python

C:\Users\jagan\AppData\Local\Temp\ipykernel_9588\3182216756.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  population[0] # retreving data using default indexing # implicit - index generated by python

38956785

In [13]:
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [14]:
population['California':'Illinois'] # slicing

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [15]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [16]:
pd.Series( [2,4,6] , index=[100,200,300] ) # here i am giving index explicitly, just like in dictionary

100    2
200    4
300    6
dtype: int64

In [17]:
s= pd.Series( [2,4,6] , index=[100,200,300] )
s.reset_index() # this is data frame

   index  0
0    100  2
1    200  4
2    300  6

Let’s discuss how to reset index in Pandas DataFrame. Often We start with a huge dataframe in Pandas and after manipulating/filtering the dataframe, we end up with much smaller dataframe.

When we look at the smaller dataframe, it might still carry the row index of the original dataframe. If the original index are numbers, now we have indexes that are not continuous. Well, pandas has reset_index() function. So to reset the index to the default integer index beginning at 0, We can simply use the reset_index() function.

In [18]:
# Reset index example 


# First see original DataFrame.


import pandas as pd

data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] }
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
  
df


# Example #1: Make Own Index Without Removing Default index.

import pandas as pd
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'],
        'Age':[27, 24, 22, 32, 15],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] }
  
index = ['a', 'b', 'c', 'd', 'e']
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data, index)
  
# Make Own Index as index
# In this case default index is exist 

df.reset_index(inplace = True)
  
df

# try more options 

# Example 2: Make Own Index and Removing Default index.
# Example 3: Reset own index and make default index as index.
# Example 4: Make a column of dataframe as index with remove default index.
# Example 5: Make a column of dataframe as index without remove default index.

  index    Name  Age    Address Qualification
0     a     Jai   27      Delhi           Msc
1     b  Princi   24     Kanpur            MA
2     c  Gaurav   22  Allahabad           MCA
3     d    Anuj   32    Kannauj           Phd
4     e   Geeku   15      Noida          10th

Example 2: Make Own Index and Removing Default index.

# Create own index
index = {'a', 'b', 'c', 'd', 'e'}
  
# Convert the dictionary into DataFrame 
# Make Own Index and Removing Default index
df = pd.DataFrame(data, index)
  
df

Example 3: Reset own index and make default index as index.

# Create own index
index = {'a', 'b', 'c', 'd', 'e'}
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data, index)
  
# remove own index with default index
df.reset_index(inplace = True, drop = True)
  
df

Example 4: Make a column of dataframe as index with remove default index.

# Create own index
index = {'a', 'b', 'c', 'd', 'e'}
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data, index)
  
# set index any column of our DF and
# remove default index
df.set_index(['Age'], inplace = True)
  
df

Example 5: Make a column of dataframe as index without remove default index.

# Create own index
index = {'a', 'b', 'c', 'd', 'e'}
  
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data, index)
  
# set any column as index
# Here we set age column as index
df.set_index(['Age'], inplace = True)
  
# reset index without removing default index
df.reset_index(level =['Age'], inplace = True)
  
df

# Create Series from a scalar

In [19]:
pd.Series( 5 )

0    5
dtype: int64

In [20]:
pd.Series( 5 , index=[100,200,300] ) # single number in a series it will broadcast the same value
# to all index

100    5
200    5
300    5
dtype: int64

In [21]:
pd.Series( {2:'a' ,  1:'b', 3:'c'} ) # series using dictionary

2    a
1    b
3    c
dtype: object

In [22]:
pd.Series( {2:'a' ,  1:'b', 3:'c'}, index=[3,2] ) # it will select only 3 and 2 of dictionary

3    c
2    a
dtype: object

In [23]:
population

California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135
dtype: int64

In [24]:
population.shape # Series. # when multiple series are joined together it forms a data frame

(5,)

In [25]:
type(population)

pandas.core.series.Series

In [26]:
df = pd.DataFrame(population) # converting series to data fram
df

                   0
California  38956785
Texas       26441568
New York    19555647
Florida     12364569
Illinois    12882135

In [27]:
df.shape # DataFrame

(5, 1)

# Data Frame 

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns

syntax to add column name 

pd.DataFrame(data, index, columns)

In [28]:
# Creating Dataframe from a single list

import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print (df)

# Creating Dataframe from a  list of lists
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

# Creating Dataframe from a  list of lists adding datatype
# import pandas as pd
# data = [['Alex',10],['Bob',12],['Clarke',13]]
# df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
# print df

   0
0  1
1  2
2  3
3  4
4  5

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [29]:
# Create a DataFrame from Dict of ndarrays / Lists

import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print (df)

# Note − Observe the values 0,1,2,3. They are the default index assigned to each using the function range(n).

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

In [30]:
# Ex : 2  > Let us now create an indexed DataFrame using arrays.
import pandas as pd
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [31]:
df = pd.DataFrame(population, columns=['Population']) # lets add name of the column
df

            Population
California    38956785
Texas         26441568
New York      19555647
Florida       12364569
Illinois      12882135

In [32]:
df = df.reset_index()
# Reset the index of the DataFrame, and use the default one instead. 
#If the DataFrame has a MultiIndex, this method can remove one or more levels.

df

# When we reset the index, the old index is added as a column, 
# and a new sequential index is used

        index  Population
0  California    38956785
1       Texas    26441568
2    New York    19555647
3     Florida    12364569
4    Illinois    12882135

In [33]:
df.columns  # will return all the column name

Index(['index', 'Population'], dtype='object')

In [34]:
df.columns = ['city','PopulationOfCity'] # here we are renaming the column name
df

         city  PopulationOfCity
0  California          38956785
1       Texas          26441568
2    New York          19555647
3     Florida          12364569
4    Illinois          12882135

In [35]:
df.shape

(5, 2)

# create a Datafram from List of Dictionaries

In [36]:
import pandas as pd
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [37]:
data = [ {'a':i, 'b':2*i} for i in range(3) ] # this is a list consiting of dictionaries
data

[{'a': 0, 'b': 0}, {'a': 1, 'b': 2}, {'a': 2, 'b': 4}]

In [38]:
df = pd.DataFrame(data)
df # here you can see all the values have have gone into column values
# and all the key have moved as column headers

   a  b
0  0  0
1  1  2
2  2  4

In [39]:
df = pd.DataFrame(data, index=['X','Y','Z'])   # custom indexing
df

   a  b
X  0  0
Y  1  2
Z  2  4

In [40]:
df.columns

Index(['a', 'b'], dtype='object')

In [41]:
df.columns=['A','B']
df

   A  B
X  0  0
Y  1  2
Z  2  4

In [42]:
df.index = ['m','n','o']
df

   A  B
m  0  0
n  1  2
o  2  4

In [43]:
pd.DataFrame( [ {'a':1,'b':2} , {'b':3,'c':4} ] )

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [44]:
# Create a DataFrame from Dict of Series

import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

# Creating a Data fram using Numpy Random

In [45]:
import numpy as np
pd.DataFrame(np.random.rand(3,2)) # creates a randon dataframe. 
# now we want to add column names

          0         1
0  0.697359  0.629082
1  0.178980  0.866641
2  0.449639  0.643869

In [46]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['Board','Infinity']) # we added column name

      Board  Infinity
0  0.690448  0.696580
1  0.106176  0.667569
2  0.950078  0.564081

In [47]:
import numpy as np
pd.DataFrame(np.random.rand(3,2), columns=['Board','Infinity'], index=['a','b','c'])

# now lets change index which we genrally dont do

      Board  Infinity
a  0.357245  0.422555
b  0.823798  0.080210
c  0.589108  0.479445

# __Indexers: loc and iloc__

> this is very important

> Implicit indexing - Default index 

> explicit indexing - user defined index

In [48]:
data = pd.Series(['a','b','c'] , index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [49]:
# explicit index when indexing
data[1]

'a'

In [50]:
# implicit index when slicing 
data[1:3]

3    b
5    c
dtype: object

For slicing python is using implicit indexing and for Indexing python is using explicit index

In [51]:
data

1    a
3    b
5    c
dtype: object

# to over come this confusion of implicit vs explicit index pandas provides loc and iloc

In [52]:
data.loc[1] # data[1], earlier we used to write data[1],  now we are using  loc (loc is explicit)

'a'

In [53]:
# data.loc[2] # this will error out. becaue explicit index is only 1,3 & 5

In [54]:
data.iloc[2] # iloc is explicit index

'c'

In [55]:
data.loc[1:3] # slicing using explicit index

1    a
3    b
dtype: object

In [56]:
data.iloc[1:3] # Start index to End Index-1 # here SI = 1 , EI  = 3-1 # slicing using implicit index

3    b
5    c
dtype: object

In [57]:
data.loc[1:3] # whever you use loc , SI is considered as SI and 
# EI is considered as EI
# and we get entile slice including both SI and EI
# SI = 1, EI = 3

1    a
3    b
dtype: object

__Data Retrieval:__

>1. List of Dictionaries

>2. csv files

>3. Databases

In [58]:
# List of Dictionaries

d = [ {'city':'Delhi','data':1000}, {'city':'Mumbai','data':2000}, 
     {'city':'Bangalore','data':1500} ]
pd.DataFrame(d)

        city  data
0      Delhi  1000
1     Mumbai  2000
2  Bangalore  1500

In [59]:
# import CSV file from github

df = pd.read_csv("C:/users/jagan/downloads/student_records.csv")
df # data frame is collection of series

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [60]:
# csv files import from folder

df = pd.read_csv('C:/users/jagan/downloads/student_records.csv')
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [61]:
# df = pd.read_csv('C:/Users/arun_r2/Downloads/student_records.csv') 
# in the above line when you paste path change "\" with "/" slash
# df

In [62]:
df.head() # will show first 5 rows

# we will only use head and tail to understand the data. 
# if you have 10000 rows printing the csv will only print first 4 & then ... & then last few rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

In [63]:
df.head(3)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes
1   John            C        N             85            51       Yes
2  David            F        N             10            17        No

In [64]:
df.head(6)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes

In [65]:
df.tail() # last 5 rows

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [66]:
df.tail(2)

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [67]:
np.ndim(df) # this is a 2D struture with rows and column

2

In [68]:
df.shape # 8 rows and 6 columns

(8, 6)

In [69]:
df.info()

# strings are indicated by data type object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [70]:
df.describe()
# it is used to get the summary of all numeric columns. Numeric columns only

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [71]:
# print(df.quantile (.5))
# print()
# print(df.quantile (.35))
# print()
# print(df.quantile (.65))

# Databases

import cx_Oracle

server = 'xxxxxxxx' # Address of the database server
user = 'xxxxxx' # the username for the database server
password = 'xxxxxx' # password for the database server

conn = cxOracle.connect( server=server, user=user, password=password )

query = 'select * from some_table'

df = pd.read_sql( query , conn )

In [72]:
# Column selection 

df.Recommend # helps to look at only recommend column

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [73]:
df['Recommend'] # another value- this method can be used space in the file name

0    Yes
1    Yes
2     No
3     No
4     No
5    Yes
6     No
7     No
Name: Recommend, dtype: object

In [74]:
type(df) # here it will say type Data frame

pandas.core.frame.DataFrame

In [75]:
type(df.Recommend) # here it will say type series. Multiple series stiched together forms a
# data frame

pandas.core.series.Series

In [76]:
# how to select multiple columns 

# df['OverallGrade','Recommend'] # this will give key error with one square bracket

df[['OverallGrade','Recommend']]

  OverallGrade Recommend
0            A       Yes
1            C       Yes
2            F        No
3            B        No
4            E        No
5            A       Yes
6            B        No
7            C        No

In [77]:
df.columns # column is an attribute

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [78]:
df.describe(include = 'all') # describe will give result for numeric column only

# to get result for all columns use the above statement

         Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
count       8            8        8       8.000000      8.000000         8
unique      8            5        2            NaN           NaN         2
top     Henry            A        Y            NaN           NaN        No
freq        1            2        5            NaN           NaN         5
mean      NaN          NaN      NaN      63.375000     53.125000       NaN
std       NaN          NaN      NaN      31.640559     24.752705       NaN
min       NaN          NaN      NaN      10.000000     17.000000       NaN
25%       NaN          NaN      NaN      50.000000     32.250000       NaN
50%       NaN          NaN      NaN      75.000000     55.000000       NaN
75%       NaN          NaN      NaN      86.250000     73.000000       NaN
max       NaN          NaN      NaN      92.000000     85.000000       NaN

In [79]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [80]:
ser = df.ProjectScore
print(ser)
print(type(ser))
print(ser.shape)

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64
<class 'pandas.core.series.Series'>
(8,)

In [81]:
df['ProjectScore']

0    85
1    51
2    17
3    71
4    30
5    79
6    59
7    33
Name: ProjectScore, dtype: int64

In [82]:
df.shape

(8, 6)

In [83]:
list(df.columns)

['Name',
 'OverallGrade',
 'Obedient',
 'ResearchScore',
 'ProjectScore',
 'Recommend']

In [84]:
# rename a column 

df.columns = ['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend']
df # now you can see Name is renamed to Student name

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [85]:
# Summary of the numeric columns
df.describe()

       ResearchScore  ProjectScore
count       8.000000      8.000000
mean       63.375000     53.125000
std        31.640559     24.752705
min        10.000000     17.000000
25%        50.000000     32.250000
50%        75.000000     55.000000
75%        86.250000     73.000000
max        92.000000     85.000000

In [86]:
df['ResearchScore'].quantile(0.5)

75.0

In [87]:
df['ResearchScore'].quantile(0.9)

90.6

In [88]:
df['ResearchScore'].mean()

63.375

In [89]:
df['ResearchScore'].count()

8

In [90]:
df.columns # All cols

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [91]:
x = df.drop('Name',axis=1)
x

# df.drop(0) # 0th row will be dropped
# df.drop(7) # 7th row will be dropped

# to drop columns change axis to 1 . By default value of axis is 0

# df.drop(0, axis = 1)

# to drop more than one column

#ff = df.drop(['Student_Name', 'Recommend'], axis = 1) # to delete multiple column you should write
# in the form of the list

  OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0            A        Y             90            85       Yes
1            C        N             85            51       Yes
2            F        N             10            17        No
3            B        Y             75            71        No
4            E        N             20            30        No
5            A        Y             92            79       Yes
6            B        Y             60            59        No
7            C        Y             75            33        No

In [92]:
df.info() # this will give me all the column name and data type
# df.info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [93]:
# Numeric cols
df.describe().columns

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [94]:
df.columns # all the colums. so if we subtract all_the columsn with Numeric col we will get
# categorical columns

# but this required type casting 

# df.columns - df.describe().columns # this command will error out

# list(df.columns) - list(df.describe().columns) # this also will error out

# but we can use a - b

Index(['Name', 'OverallGrade', 'Obedient', 'ResearchScore', 'ProjectScore',
       'Recommend'],
      dtype='object')

In [95]:
# Categorical cols
list(set(x.columns) - set(x.describe().columns))

['Recommend', 'OverallGrade', 'Obedient']

In [96]:
cat_col = list(set(x.columns) - set(x.describe().columns)) # this is like calculated feild
cat_col

['Recommend', 'OverallGrade', 'Obedient']

In [97]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           8 non-null      object
 1   OverallGrade   8 non-null      object
 2   Obedient       8 non-null      object
 3   ResearchScore  8 non-null      int64
 4   ProjectScore   8 non-null      int64
 5   Recommend      8 non-null      object
dtypes: int64(2), object(4)
memory usage: 516.0+ bytes

In [98]:
num_cols = df.select_dtypes(include=['int','float'])
num_cols

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [99]:
num_cols = df.select_dtypes(include=['int','float']).columns
num_cols

Index(['ResearchScore', 'ProjectScore'], dtype='object')

In [100]:
cat_cols = df.select_dtypes(exclude=['int','float']).columns
cat_cols

Index(['Name', 'OverallGrade', 'Obedient', 'Recommend'], dtype='object')

In [101]:
x[cat_col]

  Recommend OverallGrade Obedient
0       Yes            A        Y
1       Yes            C        N
2        No            F        N
3        No            B        Y
4        No            E        N
5       Yes            A        Y
6        No            B        Y
7        No            C        Y

In [102]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [103]:
df.iloc[:,:] # this will give all data
df.iloc[0,0] # Henry
df.iloc[4,3] # 4th row and 3rd column
df.iloc[:5,:] # rows from 0 to (5-1) and all columns
df.iloc[:5,:2] # rows from 0 to (5-1) and column from 0 to (2-1)

     Name OverallGrade
0   Henry            A
1    John            C
2   David            F
3  Holmes            B
4  Marvin            E

In [104]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [105]:
df['ResearchScore'] >=80

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: ResearchScore, dtype: bool

In [106]:
# Find the students who have got the research score >=80 and project score >= 80

df[(df['ResearchScore'] >=80) & (df['ProjectScore'] >=80)]

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y             90            85       Yes

In [107]:
# Find the students who have got the research score >=60 and project score >= 70 and 
# name starts with H

x = df[(df['ResearchScore'] >=60) & (df['ProjectScore'] >=70)]
x

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
3  Holmes            B        Y             75            71        No
5   Simon            A        Y             92            79       Yes

In [108]:
x[x['Name'].str.startswith('H')] # in the above x apply starts with filter

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
3  Holmes            B        Y             75            71        No

In [109]:
# above 2 cells in one line
import warnings # if we remove this you can see we will get warnings
warnings.filterwarnings("ignore")
df[ ( df['ResearchScore'] >=60) & (df['ProjectScore'] >=70)][df['Name'].str.startswith('H')]

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
3  Holmes            B        Y             75            71        No

In [110]:
# Find the students who have got the research score >=80

df[df['ResearchScore'] >=80]['Name']

0    Henry
1     John
5    Simon
Name: Name, dtype: object

In [111]:
x = df[df['ResearchScore'] >=80]['Name'] # we can get the output as a list
list(x)

['Henry', 'John', 'Simon']

In [112]:
df[df['ResearchScore'] >=80]['Name'].shape[0]

3

In [113]:
df[df['ResearchScore'] >=80]['Name'].shape[0]+47

50

In [114]:
# Find the students who have got the research score >=80

df.where(df.ResearchScore >= 80)

    Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0  Henry            A        Y           90.0          85.0       Yes
1   John            C        N           85.0          51.0       Yes
2    NaN          NaN      NaN            NaN           NaN       NaN
3    NaN          NaN      NaN            NaN           NaN       NaN
4    NaN          NaN      NaN            NaN           NaN       NaN
5  Simon            A        Y           92.0          79.0       Yes
6    NaN          NaN      NaN            NaN           NaN       NaN
7    NaN          NaN      NaN            NaN           NaN       NaN

In [115]:
df['OverallGrade'].unique() # helps to check unique values in large data sets

array(['A', 'C', 'F', 'B', 'E'], dtype=object)

In [116]:
df['Obedient'].unique() # this helps to understand the overall data sets

array(['Y', 'N'], dtype=object)

In [117]:
df['OverallGrade'].value_counts() # how many guys got A ,B, C ..

OverallGrade
A    2
C    2
B    2
F    1
E    1
Name: count, dtype: int64

In [118]:
df['Recommend'].value_counts()

Recommend
No     5
Yes    3
Name: count, dtype: int64

In [119]:
df['Recommend'].value_counts(normalize = True) # 62.5 % recommended

Recommend
No     0.625
Yes    0.375
Name: proportion, dtype: float64

In [120]:
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [121]:
nparray = df.values
print(nparray)
print(type(nparray))
print(nparray.shape)

[['Henry' 'A' 'Y' 90 85 'Yes']
 ['John' 'C' 'N' 85 51 'Yes']
 ['David' 'F' 'N' 10 17 'No']
 ['Holmes' 'B' 'Y' 75 71 'No']
 ['Marvin' 'E' 'N' 20 30 'No']
 ['Simon' 'A' 'Y' 92 79 'Yes']
 ['Robert' 'B' 'Y' 60 59 'No']
 ['Trent' 'C' 'Y' 75 33 'No']]
<class 'numpy.ndarray'>
(8, 6)

In [122]:
df['ResearchScore']

0    90
1    85
2    10
3    75
4    20
5    92
6    60
7    75
Name: ResearchScore, dtype: int64

In [123]:
df['ResearchScore'].sum()

507

In [124]:
col_num = df.describe().columns
x = df[col_num]
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [125]:
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [126]:
x.sum()

ResearchScore    507
ProjectScore     425
dtype: int64

In [127]:
x.sum(axis=0) #by default axis = 0

ResearchScore    507
ProjectScore     425
dtype: int64

In [128]:
x.sum(axis=1) # add rows from left to right

0    175
1    136
2     27
3    146
4     50
5    171
6    119
7    108
dtype: int64

In [129]:
x.mean(axis=0)

ResearchScore    63.375
ProjectScore     53.125
dtype: float64

In [130]:
x.mean(axis=1)

0    87.5
1    68.0
2    13.5
3    73.0
4    25.0
5    85.5
6    59.5
7    54.0
dtype: float64

In [131]:
x.count(axis=0)

ResearchScore    8
ProjectScore     8
dtype: int64

In [132]:
x.count(axis=1)

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
dtype: int64

In [133]:
x

   ResearchScore  ProjectScore
0             90            85
1             85            51
2             10            17
3             75            71
4             20            30
5             92            79
6             60            59
7             75            33

In [134]:
x['TOTAL'] = x['ResearchScore'] + x['ProjectScore'] # this will add a new column called total score
x

   ResearchScore  ProjectScore  TOTAL
0             90            85    175
1             85            51    136
2             10            17     27
3             75            71    146
4             20            30     50
5             92            79    171
6             60            59    119
7             75            33    108

In [135]:
x['PercentageScored'] = (x.TOTAL/200)*100
x

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175              87.5
1             85            51    136              68.0
2             10            17     27              13.5
3             75            71    146              73.0
4             20            30     50              25.0
5             92            79    171              85.5
6             60            59    119              59.5
7             75            33    108              54.0

In [136]:
import numpy as np # now let round off the percentage
x.PercentageScored = np.round(x.PercentageScored,0)
x

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175              88.0
1             85            51    136              68.0
2             10            17     27              14.0
3             75            71    146              73.0
4             20            30     50              25.0
5             92            79    171              86.0
6             60            59    119              60.0
7             75            33    108              54.0

In [137]:
# now lets change the data type of PercentageScored to int

x.PercentageScored = x.PercentageScored.astype('int') 
x

   ResearchScore  ProjectScore  TOTAL  PercentageScored
0             90            85    175                88
1             85            51    136                68
2             10            17     27                14
3             75            71    146                73
4             20            30     50                25
5             92            79    171                86
6             60            59    119                60
7             75            33    108                54

In [138]:
x.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ResearchScore     8 non-null      int64
 1   ProjectScore      8 non-null      int64
 2   TOTAL             8 non-null      int64
 3   PercentageScored  8 non-null      int32
dtypes: int32(1), int64(3)
memory usage: 356.0 bytes

In [139]:
x['TIMEPASS'] = 9999
x

   ResearchScore  ProjectScore  TOTAL  PercentageScored  TIMEPASS
0             90            85    175                88      9999
1             85            51    136                68      9999
2             10            17     27                14      9999
3             75            71    146                73      9999
4             20            30     50                25      9999
5             92            79    171                86      9999
6             60            59    119                60      9999
7             75            33    108                54      9999

In [140]:
# reading an excel file

df_StaffingData = pd.read_excel("c:/Users/jagan/Downloads/Staffing Data.xlsx")
df_StaffingData.head()

  State Month  Demand
0     A   Jan    5240
1     A   Feb    4878
2     A   Mar    5942
3     A   Apr    2297
4     A   May    1992

In [141]:
df_Cost = pd.read_excel("c:/Users/jagan/Downloads/Staffing Data.xlsx")
df_Cost.head()

  State Month  Demand
0     A   Jan    5240
1     A   Feb    4878
2     A   Mar    5942
3     A   Apr    2297
4     A   May    1992

# Fill Missing Values

In [142]:
# Fill NA - used to filling missing values
from numpy import nan
df.iloc [1,1] = nan
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John          NaN        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [143]:
df.iloc [1,2] = nan
df.iloc [1,5] = nan
df.iloc [1,3] = nan
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y           90.0            85       Yes
1    John          NaN      NaN            NaN            51       NaN
2   David            F        N           10.0            17        No
3  Holmes            B        Y           75.0            71        No
4  Marvin            E        N           20.0            30        No
5   Simon            A        Y           92.0            79       Yes
6  Robert            B        Y           60.0            59        No
7   Trent            C        Y           75.0            33        No

In [144]:
# now in the above output cell NaN are missing values. so we can fill the missing values
# with the some fixed value or we can replace the missing value with average of the column..etc

df.ResearchScore.fillna(0, axis = 0, inplace = True) # inplace = True will make the change to 
# the data frame. If you remove inplace = True it will just show one column output with change
# and no change will be made to the df
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y           90.0            85       Yes
1    John          NaN      NaN            0.0            51       NaN
2   David            F        N           10.0            17        No
3  Holmes            B        Y           75.0            71        No
4  Marvin            E        N           20.0            30        No
5   Simon            A        Y           92.0            79       Yes
6  Robert            B        Y           60.0            59        No
7   Trent            C        Y           75.0            33        No

In [145]:
df.iloc [1,3] = nan # lets replace it again with NAN and i can replace NaN with mean
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y           90.0            85       Yes
1    John          NaN      NaN            NaN            51       NaN
2   David            F        N           10.0            17        No
3  Holmes            B        Y           75.0            71        No
4  Marvin            E        N           20.0            30        No
5   Simon            A        Y           92.0            79       Yes
6  Robert            B        Y           60.0            59        No
7   Trent            C        Y           75.0            33        No

In [146]:
df.ResearchScore.mean()

60.285714285714285

In [147]:
df.ResearchScore.fillna(df.ResearchScore.mean(), axis = 0) # this query is used to check output

# to make the change in df use inplace = True as mentioned above

0    90.000000
1    60.285714
2    10.000000
3    75.000000
4    20.000000
5    92.000000
6    60.000000
7    75.000000
Name: ResearchScore, dtype: float64

In [148]:
df.ResearchScore.fillna(df.ResearchScore.mean(), axis = 0, inplace = True) 
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John          NaN      NaN      60.285714            51       NaN
2   David            F        N      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

Whenever you have missing values in the Numerical column in your data. you can either fill it by 0 or mean or median of that column

But when to do what?

If your business calls allow you to substitue by 0, go for it

Else, look at the mean and the median of that column, IF the dats is normally distributed (Mean = Median), then substitute by mean

Else substitute by median

In [149]:
# for examaple lets check mean and median

df.ResearchScore.describe() # here mean = median is not equal but their difference is small

count     8.000000
mean     60.285714
std      30.410122
min      10.000000
25%      50.000000
50%      67.642857
75%      78.750000
max      92.000000
Name: ResearchScore, dtype: float64

In [150]:
# now lets try to treat categorical values 

df.Recommend.value_counts()

Recommend
No     5
Yes    2
Name: count, dtype: int64

In [151]:
df.Recommend.value_counts(normalize = True)

# here we can see 71% is not recommended. Lets look at the mode of the data

Recommend
No     0.714286
Yes    0.285714
Name: proportion, dtype: float64

In [152]:
df.Recommend.mode() # but there is a prob with this, the output is in the form of a series

0    No
Name: Recommend, dtype: object

In [153]:
type(df.Recommend.mode())

pandas.core.series.Series

In [154]:
df.Recommend.mode()[0]

'No'

In [155]:
df.Recommend.fillna(df.Recommend.mode()[0], inplace = True)
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John          NaN      NaN      60.285714            51        No
2   David            F        N      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

In [156]:
# another way to treat categorical columns
# at times it is desirable that the data is collected in groups.
# Class ,Name & weight of students example

# lets understand wat is ffill ( forward fill).. When it comes to ffill we will traverse
# top to down. the missing values will be replace by the above value

# similarly bfill will replace the missing value with the value below it

In [157]:
# check using this df.Obedient.fillna(method = 'ffill')

df.Obedient.fillna(method = 'ffill', inplace = True)
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John          NaN        Y      60.285714            51        No
2   David            F        N      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

In [158]:
df.OverallGrade.fillna(method = 'bfill', inplace = True) #backward fill
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John            F        Y      60.285714            51        No
2   David            F        N      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

When you have missing values in a Categorical column, it is advisable to fill it using mode of that column if the column values are shuffled.

However, if the data is in groupd you can use ffill or bfill as per what fits the best

Also you can fill the missing values by a constant

In [159]:
df.iloc[2,2]=nan
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John            F        Y      60.285714            51        No
2   David            F      NaN      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

In [160]:
df.Obedient.fillna('Y', inplace = True) # this is replacing with a constant value
df

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y      90.000000            85       Yes
1    John            F        Y      60.285714            51        No
2   David            F        Y      10.000000            17        No
3  Holmes            B        Y      75.000000            71        No
4  Marvin            E        N      20.000000            30        No
5   Simon            A        Y      92.000000            79       Yes
6  Robert            B        Y      60.000000            59        No
7   Trent            C        Y      75.000000            33        No

# Group By - SPLIT - APPLY - COMBINE

In [161]:
import pandas as pd

df = pd.read_csv("https://raw.githubusercontent.com/ArunRavi93/Python/main/student_records.csv")
df # data frame is collection of series

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No
5   Simon            A        Y             92            79       Yes
6  Robert            B        Y             60            59        No
7   Trent            C        Y             75            33        No

In [162]:
dff = pd.DataFrame({
    'key' : ['A','B','C','A','B','C'],
    'data': range(1,7)
})
dff

  key  data
0   A     1
1   B     2
2   C     3
3   A     4
4   B     5
5   C     6

In [163]:
dff.key.unique()

array(['A', 'B', 'C'], dtype=object)

In [164]:
dff.groupby('key') # but here i have not supplied the aggregate function.
# so this above line performs only split

In [165]:
dff.groupby('key').sum()  # Groupy which column and what aggregate function to use

     data
key
A       5
B       7
C       9

In [166]:
dff.groupby('key').mean()

     data
key
A     2.5
B     3.5
C     4.5

In [167]:
dff.groupby('key').max()

     data
key
A       4
B       5
C       6

In [168]:
dff.groupby('key').describe()

     data
    count mean      std  min   25%  50%   75%  max
key
A     2.0  2.5  2.12132  1.0  1.75  2.5  3.25  4.0
B     2.0  3.5  2.12132  2.0  2.75  3.5  4.25  5.0
C     2.0  4.5  2.12132  3.0  3.75  4.5  5.25  6.0

In [169]:
dff.groupby('key').aggregate([min,'max','mean','std','var',np.std,'count']) 
# you can use aggregate function to get multiple aggregats

    data
     min max mean      std  var      std count
key
A      1   4  2.5  2.12132  4.5  2.12132     2
B      2   5  3.5  2.12132  4.5  2.12132     2
C      3   6  4.5  2.12132  4.5  2.12132     2

# Titanic Data Set - lets understand with application

In [170]:
titanic = pd.read_csv("https://raw.githubusercontent.com/ArunRavi93/Python/main/titanic.csv")
titanic.head() # lets understand the data first - titanic ship route

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [171]:
titanic.shape # 891 rows # 12 columns

(891, 12)

In [ ]:
groupby_sex = titanic.groupby('Sex')
groupby_sex.mean(numeric_only=False)

In [181]:
# lets focus on only Survived column
titanic.groupby('Sex')['Survived'].mean() # 74% of female done

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [182]:
titanic.groupby('Pclass')['Survived'].mean() # class biassing

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [183]:
titanic.groupby(['Sex','Pclass'])['Survived'].mean() # grouping by 2 columns

Sex     Pclass
female  1         0.968085
        2         0.921053
        3         0.500000
male    1         0.368852
        2         0.157407
        3         0.135447
Name: Survived, dtype: float64

In [184]:
type(titanic.groupby(['Sex','Pclass'])['Survived'].mean()) # this is a series

pandas.core.series.Series

In [185]:
titanic.groupby(['Sex','Pclass'])['Survived'].mean().unstack() # this is now converted into 
# dataframe

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [186]:
# Pivot table

titanic.pivot_table('Survived',index='Sex', columns='Pclass') # same output as above

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

 # Write into Excel file

In [ ]:
import pandas as pd
import openpyxl

# create a sample df

df = pd.DataFrame([[11, 21, 31], [12, 22, 32], [31, 32, 33]],
                  index=['one', 'two', 'three'], columns=['a', 'b', 'c'])

print(df)

In [ ]:
df.to_excel('pandas_to_excel.xlsx', sheet_name='new_sheet_name') # this will create new excel
# with table name new_sheet_name

# To import from SQL Database

In [ ]:
import pymysql
import pandas as pd

conn=pymysql.connect(host='127.0.0.1',port=int(3306),user='root',passwd='Root@123',db='sakila')

df=pd.read_sql_query("SELECT * FROM actor",conn)

print(df)